src/DataProcessors/SabatexExchangeManualControl.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>SabatexExchangeManualControl</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>NodeSelector</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateQuery</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/SabatexExchangeIds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>SabatexExchangeIds</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>objectRef</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>NodeName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>InternalObjectRef</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/SabatexExchangeManualControl/Forms/ObjectEditForm/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ObjectId = Parameters.ObjectId;
	NodeName = Parameters.NodeName;
	ObjectType = Parameters.ObjectType;
	ObjectRef = SabatexExchange.GetObjectManager(ObjectType).GetRef(new uuid(ObjectId));
	Query = New Query;
	Query.Text = 
		"SELECT TOP 1
		|	SabatexExchangeIds.objectRef AS objectRef
		|FROM
		|	InformationRegister.SabatexExchangeIds AS SabatexExchangeIds
		|WHERE
		|	SabatexExchangeIds.NodeName = &NodeName
		|	AND SabatexExchangeIds.ObjectType = &ObjectType
		|	AND SabatexExchangeIds.InternalObjectRef = &InternalObjectRef";
	
	Query.SetParameter("InternalObjectRef", ObjectId);
	Query.SetParameter("NodeName", Lower(NodeName));
	Query.SetParameter("ObjectType", SabatexExchange.GetNormalizedObjectType(ObjectType));
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	
	if SelectionDetailRecords.Next() then
			SabatexExchangeId = SelectionDetailRecords.objectRef;
	Endif;
	
КонецПроцедуры

&НаСервере
procedure SaveНаСервере()
	SabatexExchange.RegisterExtrnalId(ObjectRef,NodeName,SabatexExchangeId);
endprocedure

&НаКлиенте
Процедура Save(Команда)
	SaveНаСервере();
	object = new Map;
	object["ObjectId"] = ObjectId;
	object["ObjectType"] = ObjectType;
	object["NodeName"] = NodeName;
	object["SabatexExchangeId"] = SabatexExchangeId; 
	Notify("SabatexExchangeUpdateSabatexExchangeIds",object);
	Close();
КонецПроцедуры

&НаСервереБезКонтекста
function CleanValueAtServer(objectRef)
	obj = objectRef.GetObject(); 
	try 
		obj.SabatexExchangeId = SabatexExchange.GetEmptyUUID();
		obj.write();
		return undefined;
	except
		return ErrorDescription();
	endtry;
endfunction

&AtClient
Procedure CleanValue(Command)
	r = Вопрос("Ви впевнені що хочете скинути привязку даного елемента?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, Параметры.ObjectRef);	
	if r =  КодВозвратаДиалога.Да then
		CleanValueAtServer(Параметры.ObjectRef);
	endif;
	
	Close();
EndProcedure

&AtClient
Procedure CheckUUID(Command)
		
EndProcedure
